# FloatingRectangle Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
DockablePaneState..::..FloatingRectangle Property
DockablePaneState Class See Also
---
When %dockPosition% is Floating, this rectangle determines the size and position of the pane. Coordinates are relative to the upper-left-hand corner of the main Revit window. Note: the returned Rectangle is a copy. In order to change the pane state, you must call SetFloatingRectangle with a modified rectangle.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public Rectangle FloatingRectangle { get; }
```

Visual Basic
---
```text
Public ReadOnly Property FloatingRectangle As Rectangle
	Get
```

Visual C++
---
```text
public:
property Rectangle^ FloatingRectangle {
	Rectangle^ get ();
}
```

# See Also
DockablePaneState Class
Autodesk.Revit.UI Namespace